[Killed] BlockStatement
main/components/HelpRequest/HelpRequestTable.jsx:26:42
   );
   // Stryker restore all
 
-  const deleteCallback = async (cell) => {
-    // Support both possible shapes of cell
-    const id = cell.row.original.id;
-
-    deleteMutation.mutate({ id });
-  };
+  const deleteCallback = async (cell) => {};
 
   const columns = [
killedBy: HelpRequestIndexPage tests delete button works for admin user
statusReason: expected "spy" to be called with arguments: [ 'helpRequest with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.jsx:30:27
     // Support both possible shapes of cell
     const id = cell.row.original.id;
 
-    deleteMutation.mutate({ id });
+    deleteMutation.mutate({});
   };
 
killedBy: HelpRequestTable tests Delete button calls delete callback
statusReason: expected { id: undefined } to deeply equal { id: 1 }

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:48:20
     },
     {
       header: "Table/Breakout Room",
-      accessorKey: "tableOrBreakoutRoom",
+      accessorKey: "",
     },
     {
killedBy: HelpRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-tableOrBreakoutRoom"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"
