[Killed] BlockStatement
src/main/utils/HelpRequestUtils.jsx:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  const id = cell?.row?.original.id ?? cell?.id;
-
-  return {
-    url: "/api/helprequest",
-    method: "DELETE",
-    params: { id },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: HelpRequestTable tests Delete button calls delete callback
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/main/utils/HelpRequestUtils.jsx:9:14
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  const id = cell?.row?.original.id ?? cell?.id;
+  const id = cell?.row.original.id ?? cell?.id;
 
   return {
killedBy: HelpRequestTable tests Delete button calls delete callback
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/main/utils/HelpRequestUtils.jsx:9:14
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  const id = cell?.row?.original.id ?? cell?.id;
+  const id = cell?.row?.original.id && cell?.id;
 
   return {
killedBy: HelpRequestTable tests Delete button calls delete callback
statusReason: expected { id: undefined } to deeply equal { id: 1 }
