[Survived] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:130:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="done">Done?</Form.Label>
         <Form.Check
-          data-testid={testIdPrefix + "-done"}
+          data-testid={testIdPrefix + ""}
           id="done"
           type="checkbox"
