[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (recommendationrequest) => ({
-    url: "/api/recommendationrequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: recommendationrequest.requesterEmail,
-      professorEmail: recommendationrequest.professorEmail,
-      explanation: recommendationrequest.explanation,
-      dateRequested: recommendationrequest.dateRequested,
-      dateNeeded: recommendationrequest.dateNeeded,
-      done: recommendationrequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationrequest) => {
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:9:10
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
   const objectToAxiosParams = (recommendationrequest) => ({
-    url: "/api/recommendationrequests/post",
+    url: "",
     method: "POST",
     params: {
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New request Created - id: 1 requesteremail: test",

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:21:48
     },
   });
 
-  const onSuccess = (recommendationrequest) => {
-    toast(
-      `New request Created - id: ${recommendationrequest.id} requesteremail: ${recommendationrequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (recommendationrequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
