[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (request) => ({
-    url: "/api/recommendationrequests",
-    method: "PUT",
-    params: {
-      id: request.id,
-    },
-    data: {
-      requesterEmail: request.requesterEmail,
-      professorEmail: request.professorEmail,
-      explanation: request.explanation,
-      dateRequested: request.dateRequested,
-      dateNeeded: request.dateNeeded,
-      done: request.done,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (request) => {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "RecommendationRequest Updated - id: 17 requesteremail: bob@ucsb.edu",

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:44:34
     },
   });
 
-  const onSuccess = (request) => {
-    toast(`RecommendationRequest Updated - id: ${request.id} requesteremail: ${request.requesterEmail}`);
-  };
+  const onSuccess = (request) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Request</h1>
-        {request && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={request}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Request</h1>
-        {request && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={request}
-          />
-        )}
+        {request || <RecommendationRequestForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={request} />}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
