[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:49:47
           id="orgTranslationShort"
           type="text"
           isInvalid={Boolean(errors.orgTranslationShort)}
-          {...register("orgTranslationShort", {
-            required: "orgTranslationShort is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("orgTranslationShort", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /orgTranslationShort is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:51:24
           isInvalid={Boolean(errors.orgTranslationShort)}
           {...register("orgTranslationShort", {
             required: "orgTranslationShort is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
