[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:34:11
     params: {
       orgCode: organization.orgCode,
     },
-    data: {
-      orgTranslationShort: organization.orgTranslationShort,
-      orgTranslation: organization.orgTranslation,
-      inactive: organization.inactive,
-    },
+    data: {},
   });
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{}' to be '{"orgTranslationShort":"SKYDIVING","o…' // Object.is equality

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:43:7
 
   const onSuccess = (organization) => {
     toast(
-      `UCSBOrganization Updated - orgCode: ${organization.orgCode} orgTranslationShort: ${organization.orgTranslationShort}`,
+      ``,
     );
   };
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "UCSBOrganization Updated - orgCode: SKY orgTranslationShort: SKYDIVING",

[Killed] LogicalOperator
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
-        {organization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={organization}
-          />
-        )}
+        {organization || <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={organization} />}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expect(element).toHaveValue(SKY)

Expected the element to have value:
  SKY
Received:
