[Killed] BlockStatement
src/main/utils/ArticlesUtils.js:3:43
 import { toast } from "react-toastify";
 
-const normalizeDateAdded = (dateAdded) => {
-  let normalized = dateAdded;
-  if (normalized && !normalized.includes(":")) {
-    normalized = `${normalized}T00:00:00`;
-  } else if (normalized && normalized.match(/T\d{2}:\d{2}$/)) {
-    normalized = `${normalized}:00`;
-  }
-  return normalized;
-};
+const normalizeDateAdded = (dateAdded) => {};
 
 export function articleToCreateParams(article) {
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected { title: 'Awesome Article', …(4) } to deeply equal { title: 'Awesome Article', …(4) }

[Killed] ConditionalExpression
src/main/utils/ArticlesUtils.js:5:7
 
 const normalizeDateAdded = (dateAdded) => {
   let normalized = dateAdded;
-  if (normalized && !normalized.includes(":")) {
+  if (false) {
     normalized = `${normalized}T00:00:00`;
   } else if (normalized && normalized.match(/T\d{2}:\d{2}$/)) {
killedBy: ArticlesUtils articleToCreateParams adds default time when no time component present
statusReason: expected { url: '/api/articles/post', …(2) } to deeply equal ObjectContaining{…}

[Killed] ConditionalExpression
src/main/utils/ArticlesUtils.js:5:7
 
 const normalizeDateAdded = (dateAdded) => {
   let normalized = dateAdded;
-  if (normalized && !normalized.includes(":")) {
+  if (true) {
     normalized = `${normalized}T00:00:00`;
   } else if (normalized && normalized.match(/T\d{2}:\d{2}$/)) {
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{"title":"Advanced React","url":"http…' to be '{"title":"Advanced React","url":"http…' // Object.is equality

[Killed] BlockStatement
src/main/utils/ArticlesUtils.js:7:63
   let normalized = dateAdded;
   if (normalized && !normalized.includes(":")) {
     normalized = `${normalized}T00:00:00`;
-  } else if (normalized && normalized.match(/T\d{2}:\d{2}$/)) {
-    normalized = `${normalized}:00`;
-  }
+  } else if (normalized && normalized.match(/T\d{2}:\d{2}$/)) {}
   return normalized;
 };
killedBy: ArticlesUtils articleToCreateParams appends seconds when missing
statusReason: expected '2023-11-10T09:30' to be '2023-11-10T09:30:00' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/ArticlesUtils.js:7:14
   let normalized = dateAdded;
   if (normalized && !normalized.includes(":")) {
     normalized = `${normalized}T00:00:00`;
-  } else if (normalized && normalized.match(/T\d{2}:\d{2}$/)) {
+  } else if (false) {
     normalized = `${normalized}:00`;
   }
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected { title: 'Awesome Article', …(4) } to deeply equal { title: 'Awesome Article', …(4) }

[Killed] StringLiteral
src/main/utils/ArticlesUtils.js:8:18
   if (normalized && !normalized.includes(":")) {
     normalized = `${normalized}T00:00:00`;
   } else if (normalized && normalized.match(/T\d{2}:\d{2}$/)) {
-    normalized = `${normalized}:00`;
+    normalized = ``;
   }
   return normalized;
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{"title":"Advanced React","url":"http…' to be '{"title":"Advanced React","url":"http…' // Object.is equality

[Killed] BlockStatement
src/main/utils/ArticlesUtils.js:13:48
   return normalized;
 };
 
-export function articleToCreateParams(article) {
-  return {
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: normalizeDateAdded(article.dateAdded),
-    },
-  };
-}
+export function articleToCreateParams(article) {}
 
 export function articleToPutParams(article) {
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/utils/ArticlesUtils.js:17:13
   return {
     url: "/api/articles/post",
     method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: normalizeDateAdded(article.dateAdded),
-    },
+    params: {},
   };
 }
killedBy: ArticlesUtils articleToCreateParams adds default time when no time component present
statusReason: expected { url: '/api/articles/post', …(2) } to deeply equal ObjectContaining{…}

[Killed] BlockStatement
src/main/utils/ArticlesUtils.js:27:45
   };
 }
 
-export function articleToPutParams(article) {
-  return {
-    url: "/api/articles",
-    method: "PUT",
-    params: {
-      id: article.id,
-    },
-    data: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: normalizeDateAdded(article.dateAdded),
-    },
-  };
-}
+export function articleToPutParams(article) {}
 
 export function onDeleteSuccess(message) {
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Article Updated - id: 17 title: Advanced React",
