[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.jsx:8:44
 import { toast } from "react-toastify";
 
 export default function ArticlesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (article) => {
-    // Convert dateAdded from datetime-local format (YYYY-MM-DDTHH:mm) to ISO format with seconds (YYYY-MM-DDTHH:mm:ss)
-    let dateAdded = article.dateAdded;
-    if (dateAdded && !dateAdded.includes(":")) {
-      // If no time part, add default time
-      dateAdded = dateAdded + "T00:00:00";
-    } else if (dateAdded && dateAdded.match(/T\d{2}:\d{2}$/)) {
-      // If format is YYYY-MM-DDTHH:mm (without seconds), add :00
-      dateAdded = dateAdded + ":00";
-    }
-    return {
-      url: "/api/articles/post",
-      method: "POST",
-      params: {
-        title: article.title,
-        url: article.url,
-        explanation: article.explanation,
-        email: article.email,
-        dateAdded: dateAdded,
-      },
-    };
-  };
+  const objectToAxiosParams = (article) => {};
 
   const onSuccess = (article) => {
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
main/pages/Articles/ArticlesCreatePage.jsx:11:22
   const objectToAxiosParams = (article) => {
     // Convert dateAdded from datetime-local format (YYYY-MM-DDTHH:mm) to ISO format with seconds (YYYY-MM-DDTHH:mm:ss)
     let dateAdded = article.dateAdded;
-    if (dateAdded && !dateAdded.includes(":")) {
+    if (dateAdded && dateAdded.includes(":")) {
       // If no time part, add default time
       dateAdded = dateAdded + "T00:00:00";
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected { title: 'Awesome Article', …(4) } to deeply equal { title: 'Awesome Article', …(4) }

[Killed] LogicalOperator
main/pages/Articles/ArticlesCreatePage.jsx:11:9
   const objectToAxiosParams = (article) => {
     // Convert dateAdded from datetime-local format (YYYY-MM-DDTHH:mm) to ISO format with seconds (YYYY-MM-DDTHH:mm:ss)
     let dateAdded = article.dateAdded;
-    if (dateAdded && !dateAdded.includes(":")) {
+    if (dateAdded || !dateAdded.includes(":")) {
       // If no time part, add default time
       dateAdded = dateAdded + "T00:00:00";
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected { title: 'Awesome Article', …(4) } to deeply equal { title: 'Awesome Article', …(4) }

[NoCoverage] StringLiteral
main/pages/Articles/ArticlesCreatePage.jsx:13:31
     let dateAdded = article.dateAdded;
     if (dateAdded && !dateAdded.includes(":")) {
       // If no time part, add default time
-      dateAdded = dateAdded + "T00:00:00";
+      dateAdded = dateAdded + "";
     } else if (dateAdded && dateAdded.match(/T\d{2}:\d{2}$/)) {
       // If format is YYYY-MM-DDTHH:mm (without seconds), add :00

[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.jsx:14:63
     if (dateAdded && !dateAdded.includes(":")) {
       // If no time part, add default time
       dateAdded = dateAdded + "T00:00:00";
-    } else if (dateAdded && dateAdded.match(/T\d{2}:\d{2}$/)) {
-      // If format is YYYY-MM-DDTHH:mm (without seconds), add :00
-      dateAdded = dateAdded + ":00";
-    }
+    } else if (dateAdded && dateAdded.match(/T\d{2}:\d{2}$/)) {}
     return {
       url: "/api/articles/post",
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected { title: 'Awesome Article', …(4) } to deeply equal { title: 'Awesome Article', …(4) }

[Killed] ConditionalExpression
main/pages/Articles/ArticlesCreatePage.jsx:14:16
     if (dateAdded && !dateAdded.includes(":")) {
       // If no time part, add default time
       dateAdded = dateAdded + "T00:00:00";
-    } else if (dateAdded && dateAdded.match(/T\d{2}:\d{2}$/)) {
+    } else if (false) {
       // If format is YYYY-MM-DDTHH:mm (without seconds), add :00
       dateAdded = dateAdded + ":00";
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected { title: 'Awesome Article', …(4) } to deeply equal { title: 'Awesome Article', …(4) }

[Killed] StringLiteral
main/pages/Articles/ArticlesCreatePage.jsx:16:31
       dateAdded = dateAdded + "T00:00:00";
     } else if (dateAdded && dateAdded.match(/T\d{2}:\d{2}$/)) {
       // If format is YYYY-MM-DDTHH:mm (without seconds), add :00
-      dateAdded = dateAdded + ":00";
+      dateAdded = dateAdded + "";
     }
     return {
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected { title: 'Awesome Article', …(4) } to deeply equal { title: 'Awesome Article', …(4) }

[Killed] ObjectLiteral
main/pages/Articles/ArticlesCreatePage.jsx:18:12
       // If format is YYYY-MM-DDTHH:mm (without seconds), add :00
       dateAdded = dateAdded + ":00";
     }
-    return {
-      url: "/api/articles/post",
-      method: "POST",
-      params: {
-        title: article.title,
-        url: article.url,
-        explanation: article.explanation,
-        email: article.email,
-        dateAdded: dateAdded,
-      },
-    };
+    return {};
   };
 
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Articles/ArticlesCreatePage.jsx:21:15
     return {
       url: "/api/articles/post",
       method: "POST",
-      params: {
-        title: article.title,
-        url: article.url,
-        explanation: article.explanation,
-        email: article.email,
-        dateAdded: dateAdded,
-      },
+      params: {},
     };
   };
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected {} to deeply equal { title: 'Awesome Article', …(4) }

[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.jsx:31:34
     };
   };
 
-  const onSuccess = (article) => {
-    toast(
-      `New article Created - id: ${article.id} title: ${article.title}`,
-    );
-  };
+  const onSuccess = (article) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
