[Killed] BlockStatement
main/pages/Articles/ArticlesEditPage.jsx:28:47
     },
   );
 
-  const objectToAxiosPutParams = (article) => {
-    // Convert dateAdded from datetime-local format (YYYY-MM-DDTHH:mm) to ISO format with seconds (YYYY-MM-DDTHH:mm:ss)
-    let dateAdded = article.dateAdded;
-    if (dateAdded && !dateAdded.includes(":")) {
-      // If no time part, add default time
-      dateAdded = dateAdded + "T00:00:00";
-    } else if (dateAdded && dateAdded.match(/T\d{2}:\d{2}$/)) {
-      // If format is YYYY-MM-DDTHH:mm (without seconds), add :00
-      dateAdded = dateAdded + ":00";
-    }
-    return {
-      url: "/api/articles",
-      method: "PUT",
-      params: {
-        id: article.id,
-      },
-      data: {
-        title: article.title,
-        url: article.url,
-        explanation: article.explanation,
-        email: article.email,
-        dateAdded: dateAdded,
-      },
-    };
-  };
+  const objectToAxiosPutParams = (article) => {};
 
   const onSuccess = (article) => {
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Article Updated - id: 17 title: Advanced React",

[Killed] ConditionalExpression
main/pages/Articles/ArticlesEditPage.jsx:31:9
   const objectToAxiosPutParams = (article) => {
     // Convert dateAdded from datetime-local format (YYYY-MM-DDTHH:mm) to ISO format with seconds (YYYY-MM-DDTHH:mm:ss)
     let dateAdded = article.dateAdded;
-    if (dateAdded && !dateAdded.includes(":")) {
+    if (true) {
       // If no time part, add default time
       dateAdded = dateAdded + "T00:00:00";
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{"title":"Advanced React","url":"http…' to be '{"title":"Advanced React","url":"http…' // Object.is equality

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.jsx:38:12
       // If format is YYYY-MM-DDTHH:mm (without seconds), add :00
       dateAdded = dateAdded + ":00";
     }
-    return {
-      url: "/api/articles",
-      method: "PUT",
-      params: {
-        id: article.id,
-      },
-      data: {
-        title: article.title,
-        url: article.url,
-        explanation: article.explanation,
-        email: article.email,
-        dateAdded: dateAdded,
-      },
-    };
+    return {};
   };
 
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Article Updated - id: 17 title: Advanced React",

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.jsx:44:13
       params: {
         id: article.id,
       },
-      data: {
-        title: article.title,
-        url: article.url,
-        explanation: article.explanation,
-        email: article.email,
-        dateAdded: dateAdded,
-      },
+      data: {},
     };
   };
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{}' to be '{"title":"Advanced React","url":"http…' // Object.is equality
