[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:93:28
           <Form.Group className="mb-3">
             <Form.Label htmlFor="explanation">Explanation</Form.Label>
             <Form.Control
-              data-testid={`${testIdPrefix}-explanation`}
+              data-testid={``}
               id="explanation"
               type="text"
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="ArticlesForm-explanation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:113:28
           <Form.Group className="mb-3">
             <Form.Label htmlFor="email">Email</Form.Label>
             <Form.Control
-              data-testid={`${testIdPrefix}-email`}
+              data-testid={``}
               id="email"
               type="email"
killedBy: ArticlesForm tests No Error messsages on good input
statusReason: Unable to find an element by: [data-testid="ArticlesForm-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.jsx:122:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.email && "email is required."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.jsx:122:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.email && "email is required."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:133:28
           <Form.Group className="mb-3">
             <Form.Label htmlFor="dateAdded">Date Added (iso format)</Form.Label>
             <Form.Control
-              data-testid={`${testIdPrefix}-dateAdded`}
+              data-testid={``}
               id="dateAdded"
               type="datetime-local"
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Unable to find an element by: [data-testid="ArticlesForm-dateAdded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:137:41
               id="dateAdded"
               type="datetime-local"
               isInvalid={Boolean(errors.dateAdded)}
-              {...register("dateAdded", {
-                required: "DateAdded is required.",
-                pattern: isodate_regex,
-              })}
+              {...register("dateAdded", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /DateAdded is required and must be in ISO format/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.jsx:143:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateAdded &&
-                "DateAdded is required and must be in ISO format."}
+              {errors.dateAdded || "DateAdded is required and must be in ISO format."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.jsx:143:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateAdded &&
-                "DateAdded is required and must be in ISO format."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /DateAdded is required and must be in ISO format/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:144:17
             />
             <Form.Control.Feedback type="invalid">
               {errors.dateAdded &&
-                "DateAdded is required and must be in ISO format."}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /DateAdded is required and must be in ISO format/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
