[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:12:35
 import { useNavigate } from "react-router";
 import { hasRole } from "main/utils/useCurrentUser";
 
-export const ARTICLES_QUERY_KEY = "/api/articles/all";
+export const ARTICLES_QUERY_KEY = "";
 
 export default function ArticlesTable({
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: expected '' to be '/api/articles/all' // Object.is equality
