[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.jsx:38:5
 
   const mutation = useBackendMutation(
     articleToPutParams,
-    { onSuccess },
+    {},
     // Stryker disable next-line all : hard to set up test for caching
     [ARTICLES_QUERY_KEY],
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
main/pages/Articles/ArticlesEditPage.jsx:45:36
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (data) => {
-    const numericId = Number(id);
-    mutation.mutate({ ...data, id: Number.isNaN(numericId) ? id : numericId });
-  };
+  const onSubmit = async (data) => {};
 
   if (isSuccess && !storybook) {
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.jsx:47:21
 
   const onSubmit = async (data) => {
     const numericId = Number(id);
-    mutation.mutate({ ...data, id: Number.isNaN(numericId) ? id : numericId });
+    mutation.mutate({});
   };
 
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected { id: undefined } to deeply equal { id: 17 }
