[Killed] StringLiteral
main/pages/Articles/ArticlesIndexPage.jsx:17:15
   const { data: articles } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [ARTICLES_QUERY_KEY],
-    { method: "GET", url: "/api/articles/all" },
+    { method: "", url: "/api/articles/all" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: ArticlesIndexPage tests renders empty table when backend unavailable, user only
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'

[Killed] ObjectLiteral
main/pages/Articles/ArticlesIndexPage.jsx:17:5
   const { data: articles } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [ARTICLES_QUERY_KEY],
-    { method: "GET", url: "/api/articles/all" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: ArticlesIndexPage tests renders articles table for regular user
statusReason: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
