[Killed] BlockStatement
src/main/utils/ArticlesUtils.js:3:43
 import { toast } from "react-toastify";
 
-const normalizeDateAdded = (dateAdded) => {
-  if (!dateAdded) {
-    return dateAdded;
-  }
-
-  if (!dateAdded.includes(":")) {
-    return `${dateAdded}T00:00:00`;
-  }
-
-  if (/T\d{2}:\d{2}$/.test(dateAdded)) {
-    return `${dateAdded}:00`;
-  }
-
-  return dateAdded;
-};
+const normalizeDateAdded = (dateAdded) => {};
 
 export function articleToCreateParams({
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{"title":"Advanced React","url":"http…' to be '{"title":"Advanced React","url":"http…' // Object.is equality

[Killed] BooleanLiteral
src/main/utils/ArticlesUtils.js:4:7
 import { toast } from "react-toastify";
 
 const normalizeDateAdded = (dateAdded) => {
-  if (!dateAdded) {
+  if (dateAdded) {
     return dateAdded;
   }
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{"title":"Advanced React","url":"http…' to be '{"title":"Advanced React","url":"http…' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/ArticlesUtils.js:4:7
 import { toast } from "react-toastify";
 
 const normalizeDateAdded = (dateAdded) => {
-  if (!dateAdded) {
+  if (true) {
     return dateAdded;
   }
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected { title: 'Awesome Article', …(4) } to deeply equal { title: 'Awesome Article', …(4) }

[Killed] ConditionalExpression
src/main/utils/ArticlesUtils.js:8:7
     return dateAdded;
   }
 
-  if (!dateAdded.includes(":")) {
+  if (true) {
     return `${dateAdded}T00:00:00`;
   }
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected { title: 'Awesome Article', …(4) } to deeply equal { title: 'Awesome Article', …(4) }

[Killed] BooleanLiteral
src/main/utils/ArticlesUtils.js:8:7
     return dateAdded;
   }
 
-  if (!dateAdded.includes(":")) {
+  if (dateAdded.includes(":")) {
     return `${dateAdded}T00:00:00`;
   }
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{"title":"Advanced React","url":"http…' to be '{"title":"Advanced React","url":"http…' // Object.is equality

[Killed] StringLiteral
src/main/utils/ArticlesUtils.js:9:12
   }
 
   if (!dateAdded.includes(":")) {
-    return `${dateAdded}T00:00:00`;
+    return ``;
   }
 
killedBy: ArticlesUtils articleToCreateParams adds default time when no time component present
statusReason: expected { url: '/api/articles/post', …(2) } to deeply equal ObjectContaining{…}

[Killed] ConditionalExpression
src/main/utils/ArticlesUtils.js:12:7
     return `${dateAdded}T00:00:00`;
   }
 
-  if (/T\d{2}:\d{2}$/.test(dateAdded)) {
+  if (false) {
     return `${dateAdded}:00`;
   }
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected { title: 'Awesome Article', …(4) } to deeply equal { title: 'Awesome Article', …(4) }

[Killed] ConditionalExpression
src/main/utils/ArticlesUtils.js:12:7
     return `${dateAdded}T00:00:00`;
   }
 
-  if (/T\d{2}:\d{2}$/.test(dateAdded)) {
+  if (true) {
     return `${dateAdded}:00`;
   }
killedBy: ArticlesUtils articleToCreateParams leaves date unchanged when seconds present
statusReason: expected '2023-11-10T09:30:45:00' to be '2023-11-10T09:30:45' // Object.is equality

[Killed] BlockStatement
src/main/utils/ArticlesUtils.js:25:4
   explanation,
   email,
   dateAdded,
-}) {
-  return {
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title,
-      url,
-      explanation,
-      email,
-      dateAdded: normalizeDateAdded(dateAdded),
-    },
-  };
-}
+}) {}
 
 export function articleToPutParams({
killedBy: ArticlesUtils articleToCreateParams adds default time when no time component present
statusReason: expected undefined to deeply equal ObjectContaining{…}

[Killed] ObjectLiteral
src/main/utils/ArticlesUtils.js:29:13
   return {
     url: "/api/articles/post",
     method: "POST",
-    params: {
-      title,
-      url,
-      explanation,
-      email,
-      dateAdded: normalizeDateAdded(dateAdded),
-    },
+    params: {},
   };
 }
killedBy: ArticlesUtils articleToCreateParams adds default time when no time component present
statusReason: expected { url: '/api/articles/post', …(2) } to deeply equal ObjectContaining{…}

[Killed] BlockStatement
src/main/utils/ArticlesUtils.js:46:4
   explanation,
   email,
   dateAdded,
-}) {
-  return {
-    url: "/api/articles",
-    method: "PUT",
-    params: {
-      id,
-    },
-    data: {
-      title,
-      url,
-      explanation,
-      email,
-      dateAdded: normalizeDateAdded(dateAdded),
-    },
-  };
-}
+}) {}
 
 export function onDeleteSuccess(message) {
killedBy: ArticlesUtils articleToPutParams passes through data with normalized date
statusReason: expected undefined to deeply equal ObjectContaining{…}

[Killed] ObjectLiteral
src/main/utils/ArticlesUtils.js:50:13
   return {
     url: "/api/articles",
     method: "PUT",
-    params: {
-      id,
-    },
+    params: {},
     data: {
       title,
killedBy: ArticlesUtils articleToPutParams passes through data with normalized date
statusReason: expected { url: '/api/articles', …(3) } to deeply equal ObjectContaining{…}
