[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:31:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="MenuItemReview-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col>
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: Unable to find an element by: [data-testid="/MenuItemReview-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.jsx:31:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="MenuItemReview-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="MenuItemReview-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:55:38
               id="itemId"
               type="number"
               isInvalid={Boolean(errors.itemId)}
-              {...register("itemId", {
-                required: "itemId is required.",
-              })}
+              {...register("itemId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /itemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:75:45
               id="reviewerEmail"
               type="email"
               isInvalid={Boolean(errors.reviewerEmail)}
-              {...register("reviewerEmail", {
-                required: true,
-              })}
+              {...register("reviewerEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /reviewerEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:80:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.reviewerEmail && "reviewerEmail is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /reviewerEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:80:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.reviewerEmail && "reviewerEmail is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /reviewerEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:95:37
               id="stars"
               type="number"
               isInvalid={Boolean(errors.stars)}
-              {...register("stars", {
-                required: "stars is required. ",
-                min: { value: 1, message: "Minimum 1 star." },
-                max: { value: 5, message: "Maximum 5 stars." },
-              })}
+              {...register("stars", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Minimum 1 star/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:96:27
               type="number"
               isInvalid={Boolean(errors.stars)}
               {...register("stars", {
-                required: "stars is required. ",
+                required: "",
                 min: { value: 1, message: "Minimum 1 star." },
                 max: { value: 5, message: "Maximum 5 stars." },
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:97:22
               isInvalid={Boolean(errors.stars)}
               {...register("stars", {
                 required: "stars is required. ",
-                min: { value: 1, message: "Minimum 1 star." },
+                min: {},
                 max: { value: 5, message: "Maximum 5 stars." },
               })}
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Minimum 1 star/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:98:43
               {...register("stars", {
                 required: "stars is required. ",
                 min: { value: 1, message: "Minimum 1 star." },
-                max: { value: 5, message: "Maximum 5 stars." },
+                max: { value: 5, message: "" },
               })}
             />
killedBy: MenuItemReviewForm tests Correct Error messsages on stars > 5
statusReason: Unable to find an element with the text: /Maximum 5 stars/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:125:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateReviewed && "dateReviewed is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /dateReviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.jsx:125:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateReviewed && "dateReviewed is required. "}
+              {errors.dateReviewed || "dateReviewed is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Minimum 1 star/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:140:40
               id="comments"
               type="text"
               isInvalid={Boolean(errors.comments)}
-              {...register("comments", {
-                required: "comments is required.",
-              })}
+              {...register("comments", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /comments is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
