[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:38:5
       header: "id",
       accessorKey: "id", // accessor is the "key" in the data
     },
-    {
-      header: "itemId",
-      accessorKey: "itemId",
-    },
+    {},
     {
       header: "Email",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:42:5
       header: "itemId",
       accessorKey: "itemId",
     },
-    {
-      header: "Email",
-      accessorKey: "reviewerEmail",
-    },
+    {},
     {
       header: "Stars",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:50:5
       header: "Stars",
       accessorKey: "stars",
     },
-    {
-      header: "Date",
-      accessorKey: "dateReviewed",
-    },
+    {},
     {
       header: "Comments",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header
