[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:20:41
     },
   });
 
-  const onSuccess = (menuItemReview) => {
-    toast(
-      `New review created — id: ${menuItemReview.id}, reviewer: ${menuItemReview.reviewerEmail}`,
-    );
-  };
+  const onSuccess = (menuItemReview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
